get red
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
  Since:  2017
 Syntax
  C#
public uint GetRed()
  Visual Basic
Public Function GetRed As UInteger
  Visual C++
public:
unsigned int GetRed()
 Return Value
 red
 See Also
  ColorWithTransparency Class
  Autodesk.Revit.DB Namespace